tests/jmeter-scripts/FinancialChargingAPI_Load_Tests.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan - Financial Charging API" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="SECRET_KEY" elementType="Argument">
            <stringProp name="Argument.name">SECRET_KEY</stringProp>
            <stringProp name="Argument.value">${__P(secret)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(hostname)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(port)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="CLIENT_APPLICATION_KEY" elementType="Argument">
            <stringProp name="Argument.name">CLIENT_APPLICATION_KEY</stringProp>
            <stringProp name="Argument.value">${__P(clientkey)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="API_VERSION" elementType="Argument">
            <stringProp name="Argument.name">API_VERSION</stringProp>
            <stringProp name="Argument.value">v1.0</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">${__P(protocol)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BasePath" elementType="Argument">
            <stringProp name="Argument.name">BasePath</stringProp>
            <stringProp name="Argument.value">${__P(basePath)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group - POST /v1.0/client-applications" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request - POST /v1.0/client-applications" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;externalId&quot;: &quot;782c7053-0972-470c-952a-5498389f335e&quot;,&#xd;
  &quot;name&quot;: &quot;JMeter&quot;,&#xd;
  &quot;correlationKey&quot;: &quot;782c7053-0972-470c-952a-5498389f335e&quot; &#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">${API_VERSION}/client-applications</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor - GimAuthHeader" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">load(&quot;https://cdnjs.cloudflare.com/ajax/libs/crypto-js/3.1.9-1/crypto-js.js&quot;);

var secretkey = &quot;${SECRET_KEY}&quot;; 
var clientApplicationKey = &quot;${CLIENT_APPLICATION_KEY}&quot;;
var urlWithoutQueryString = &quot;${PROTOCOL}://${HOST}/${API_VERSION}/client-applications&quot;;

if ( ${PORT} ) {

	urlWithoutQueryString = &quot;${PROTOCOL}://${HOST}:${PORT}/${API_VERSION}/client-applications&quot;;
}

var method = &quot;POST&quot;;

var timestamp = Math.round(new Date().getTime()/1000);

var template = &quot;gim.&quot; + clientApplicationKey + &quot;.&quot; + method + &quot;.&quot; + urlWithoutQueryString + &quot;.&quot; + timestamp;

vars.put(&quot;GimAuthHeader_Template&quot;, template);

var sha256digest = CryptoJS.HmacSHA256(template, secretkey).toString();
var vector = CryptoJS.enc.Utf8.parse(sha256digest);
var base64sha256 = CryptoJS.enc.Base64.stringify(vector);

var authorizationHeader = &quot;GIM id=\&quot;&quot; + clientApplicationKey + &quot;\&quot;, mac=\&quot;&quot; + base64sha256 + &quot;\&quot;, ts=\&quot;&quot; + timestamp + &quot;\&quot;&quot;;  
    
vars.put(&quot;GimAuthHeader_ClientApplication&quot;, authorizationHeader);
</stringProp>
            <stringProp name="scriptLanguage">javascript</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${GimAuthHeader_ClientApplication}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">201</stringProp>
              <stringProp name="51517">409</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">true</boolProp>
            <intProp name="Assertion.test_type">40</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DebugPostProcessor guiclass="TestBeanGUI" testclass="DebugPostProcessor" testname="Debug PostProcessor" enabled="true">
            <boolProp name="displayJMeterProperties">false</boolProp>
            <boolProp name="displayJMeterVariables">true</boolProp>
            <boolProp name="displaySamplerProperties">true</boolProp>
            <boolProp name="displaySystemProperties">false</boolProp>
          </DebugPostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group - POST /v1.0/products" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request - POST /v1.0/products" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;externalId&quot;: &quot;6FAD56FB-75AC-499D-8A87-64634134A6CF&quot;,&#xd;
  &quot;name&quot;: &quot;Aluguel - Teste de carga&quot;,&#xd;
  &quot;correlationKey&quot;: &quot;6FAD56FB-75AC-499D-8A87-64634134A6CF&quot; &#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">${API_VERSION}/products</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor - GimAuthHeader" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">load(&apos;https://cdnjs.cloudflare.com/ajax/libs/crypto-js/3.1.9-1/crypto-js.js&apos;);

var secretkey = &quot;${SECRET_KEY}&quot;; 
var clientApplicationKey = &quot;${CLIENT_APPLICATION_KEY}&quot;;
var urlWithoutQueryString = &quot;${PROTOCOL}://${HOST}/${API_VERSION}/products&quot;;

if ( ${PORT} ) {

	urlWithoutQueryString = &quot;${PROTOCOL}://${HOST}:${PORT}/${API_VERSION}/products&quot;;
}

var method = &quot;POST&quot;;

var timestamp = Math.round(new Date().getTime()/1000);

var template = &quot;gim.&quot; + clientApplicationKey + &quot;.&quot; + method + &quot;.&quot; + urlWithoutQueryString + &quot;.&quot; + timestamp;

var sha256digest = CryptoJS.HmacSHA256(template, secretkey).toString();
var vector = CryptoJS.enc.Utf8.parse(sha256digest);
var base64sha256 = CryptoJS.enc.Base64.stringify(vector);

var authorizationHeader = &quot;GIM id=\&quot;&quot; + clientApplicationKey + &quot;\&quot;, mac=\&quot;&quot; + base64sha256 + &quot;\&quot;, ts=\&quot;&quot; + timestamp + &quot;\&quot;&quot;;  
    
vars.put(&apos;GimAuthHeader_Products&apos;, authorizationHeader);
</stringProp>
            <stringProp name="scriptLanguage">javascript</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${GimAuthHeader_Products}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">201</stringProp>
              <stringProp name="51517">409</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">true</boolProp>
            <intProp name="Assertion.test_type">40</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DebugPostProcessor guiclass="TestBeanGUI" testclass="DebugPostProcessor" testname="Debug PostProcessor" enabled="true">
            <boolProp name="displayJMeterProperties">false</boolProp>
            <boolProp name="displayJMeterVariables">true</boolProp>
            <boolProp name="displaySamplerProperties">true</boolProp>
            <boolProp name="displaySystemProperties">false</boolProp>
          </DebugPostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group - POST /v1.0/charges/accquirer-account" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">600</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">;</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">${BasePath}\Load_Test_Data-Create Orders.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="variableNames">ChargeCorrelationKey,StoneCode,ChargeAmount,ChargeDate</stringProp>
        </CSVDataSet>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="StoneCode" elementType="Argument">
              <stringProp name="Argument.name">StoneCode</stringProp>
              <stringProp name="Argument.value">${StoneCode}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="ChargeAmount" elementType="Argument">
              <stringProp name="Argument.name">ChargeAmount</stringProp>
              <stringProp name="Argument.value">${ChargeAmount}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="ChargeCorrelationKey" elementType="Argument">
              <stringProp name="Argument.name">ChargeCorrelationKey</stringProp>
              <stringProp name="Argument.value">${ChargeCorrelationKey}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="ChargeDate" elementType="Argument">
              <stringProp name="Argument.name">ChargeDate</stringProp>
              <stringProp name="Argument.value">${ChargeDate}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request - POST /v1.0/charges/acquirer-account" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
   &quot;amount&quot;:${ChargeAmount},&#xd;
   &quot;chargeDate&quot;:&quot;${ChargeDate}&quot;,&#xd;
   &quot;productExternalKey&quot;:&quot;6FAD56FB-75AC-499D-8A87-64634134A6CF&quot;,&#xd;
   &quot;payment&quot;:{&#xd;
      &quot;acquirerKey&quot;:&quot;stone&quot;,&#xd;
      &quot;merchantKey&quot;:&quot;${StoneCode}&quot;,&#xd;
      &quot;accountType&quot;:10&#xd;
   },&#xd;
   &quot;correlationKey&quot;:&quot;${ChargeCorrelationKey}&quot;&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">${API_VERSION}/charges/acquirer-account</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor - GimAuthHeader" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">load(&apos;https://cdnjs.cloudflare.com/ajax/libs/crypto-js/3.1.9-1/crypto-js.js&apos;);

var secretkey = &quot;${SECRET_KEY}&quot;; 
var clientApplicationKey = &quot;${CLIENT_APPLICATION_KEY}&quot;;
var urlWithoutQueryString = &quot;${PROTOCOL}://${HOST}/${API_VERSION}/charges/acquirer-account&quot;;

var port = parseInt(${PORT});

if ( port &gt; 1 ) {

	urlWithoutQueryString = &quot;${PROTOCOL}://${HOST}:${PORT}/${API_VERSION}/charges/acquirer-account&quot;;
}

vars.put(&quot;urlWithoutQueryString&quot;, urlWithoutQueryString);

var method = &quot;POST&quot;;

var timestamp = Math.round(new Date().getTime()/1000);

var template = &quot;gim.&quot; + clientApplicationKey + &quot;.&quot; + method + &quot;.&quot; + urlWithoutQueryString + &quot;.&quot; + timestamp;

var sha256digest = CryptoJS.HmacSHA256(template, secretkey).toString();
var vector = CryptoJS.enc.Utf8.parse(sha256digest);
var base64sha256 = CryptoJS.enc.Base64.stringify(vector);

var authorizationHeader = &quot;GIM id=\&quot;&quot; + clientApplicationKey + &quot;\&quot;, mac=\&quot;&quot; + base64sha256 + &quot;\&quot;, ts=\&quot;&quot; + timestamp + &quot;\&quot;&quot;;  
    
vars.put(&apos;GimAuthHeader&apos;, authorizationHeader);
</stringProp>
            <stringProp name="scriptLanguage">javascript</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${GimAuthHeader}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">ChargeOrderId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">201</stringProp>
              <stringProp name="51517">409</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">true</boolProp>
            <intProp name="Assertion.test_type">40</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DebugPostProcessor guiclass="TestBeanGUI" testclass="DebugPostProcessor" testname="Debug PostProcessor" enabled="true">
            <boolProp name="displayJMeterProperties">false</boolProp>
            <boolProp name="displayJMeterVariables">true</boolProp>
            <boolProp name="displaySamplerProperties">true</boolProp>
            <boolProp name="displaySystemProperties">false</boolProp>
          </DebugPostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${BasePath}\Load_Test_Data-Create Orders-Response.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>